docs/source/_posts/note/computer-science/type-theory/church-turing-thesis.org
#+title: church turing thesis

* intuition of computation

  - what is computation ?

  - paper-and-pencil computation performed by human

  - directed change

* formalization of computation

  - limit the scope to function on the natural numbers

* recursive function

*** (1933) (kurt gödel, jacques herbrand) general recursive function

*** (1963) (mccarthy) mccarthy formalism

    - use IF-THEN-ELSE instead of primitive recursion and the mu-operator

* lambda calculus

*** (1936) (alonzo church) lambda calculus

    - lambda expression
      can express "substitution"
      which can also be viewed as "building up environment and context"

* machine

*** (1936) (alan turing) turing machine
