out/note/type-theory/church-turing-thesis.org.html
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>note/type-theory/church-turing-thesis.org</title>
</head>
<body>
<pre style="white-space: pre-wrap;">#+title: church turing thesis

* intuition of computation

  - what is computation?

  - paper-and-pencil computation performed by human

  - directed change

* formalization of computation

  - limit the scope to function on the natural numbers

* recursive function

*** (1933) (kurt gödel, jacques herbrand) general recursive function

*** (1963) (mccarthy) mccarthy formalism

    - use IF-THEN-ELSE instead of primitive recursion and the mu-operator

* lambda calculus

*** (1936) (alonzo church) lambda calculus

    - lambda expression
      can express &quot;substitution&quot;
      which can also be viewed as &quot;building up environment and context&quot;

* machine

*** (1936) (alan turing) turing machine
</pre>
</body>
</html>
